* Description
为了用事实说明挖掘机技术到底哪家强，PAT组织了一场挖掘机技能大赛。现请你根据比赛结果统计出技术最强的那个学校。

输入描述:

输入在第1行给出不超过105的正整数N，即参赛人数。随后N行，每行给出一位参赛者的信息和成绩，包括其所代表的学校的编号（从1开始

连续编号）、及其比赛成绩（百分制），中间以空格分隔。

输出描述:

在一行中给出总得分最高的学校的编号、及其总分，中间以空格分隔。题目保证答案唯一，没有并列。

输入例子:

6

3 65

2 80

1 100

2 70

3 40

3 0

输出例子:

2 150
* Solution
#+BEGIN_SRC cpp :cmdline < input.txt
  #include <iostream>
  using namespace std;

  int main(int argc, char *argv[]) {
    int nums;
    cin >> nums;
    int scores[100001] = {0}, res = 0, max_school = 0;
    int school, score;
    for (int i = 0; i < nums; i++) {
      cin >> school >> score;
      scores[school] += score;
    }
    for (int i = 0; i < 100001; i++) {
      if (res < scores[i]) {
        max_school = i;
        res = scores[i];
      }
    }
    cout << max_school << " " << res << endl;
    return 0;
  }
#+END_SRC

#+RESULTS:
: 2 150
